K-Walega-AGH/zzpsw/FreeRTOS/Demo/ARM7_LPC2129_Keil_RVDS/serwo.c
#include <LPC21xx.H>
#include "serwo.h"
#include "led.h"
#include "timer_interrupts.h"

#define PINDET_BM (1<<10)

enum ServoState {CALLIB, OFFSET_CALLIB, IDLE, IN_PROGRESS};
enum DetectorState{ACTIVE, INACTIVE};

struct Servo {
	enum ServoState eState; 
	unsigned int uiCurrentPosition;
	unsigned int uiDesiredPosition;
};

static struct Servo sServo;

static void DetectorInit(void)
{
	IO0DIR &= ~PINDET_BM;
}

static enum DetectorState eReadDetector(void)
{
	if ((IO0PIN & PINDET_BM) != 0)
	{
		return INACTIVE;
	}
	else
	{
		return ACTIVE;
	}
}

static void Automat(void)
{
	switch(sServo.eState)
	{
		case CALLIB:
			sServo.uiCurrentPosition = 0;
			sServo.uiDesiredPosition = 0;
			
			if (eReadDetector() == INACTIVE)
			{
				LedStepLeft();
			}
			else
			{
				sServo.eState = IDLE;
			}
			break;
		case OFFSET_CALLIB:

			if (sServo.uiCurrentPosition == 12)
			{
				sServo.uiCurrentPosition = 0;
				sServo.uiDesiredPosition = 0;
				sServo.eState = IDLE;
			}
			else
			{
				sServo.uiCurrentPosition++;
				LedStepRight();
			}
			break;
		case IDLE:
			if (sServo.uiCurrentPosition != sServo.uiDesiredPosition)
			{
				sServo.eState = IN_PROGRESS;
			}
			break;
		case IN_PROGRESS:
			if (sServo.uiCurrentPosition < sServo.uiDesiredPosition)
			{
				sServo.uiCurrentPosition++;
				LedStepRight();
			}
			else if (sServo.uiCurrentPosition > sServo.uiDesiredPosition)
			{
				sServo.uiCurrentPosition--;
				LedStepLeft();
			}
			else
			{
				sServo.eState = IDLE;
			}
			break;
	}
}

void Servo_Init(unsigned int uiServoFrequency)
{
	Led_Init();
	DetectorInit();
	Timer1Interrupts_Init(1000/uiServoFrequency, Automat);
	Servo_Callib();
}

void Servo_Callib(void)
{
	sServo.eState = CALLIB;
	while(sServo.eState == CALLIB);
}

void Servo_GoTo(unsigned int uiPosition)
{
	sServo.uiDesiredPosition = uiPosition;
	
	sServo.eState = IN_PROGRESS;
	while(sServo.eState == IN_PROGRESS);
}
